W4D4/MusicApp/app/controllers/bands_controller.rb

  def create
    @band = Band.new(band_params)
    if @band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "RHCP"], ["created_at", "2017-06-22 22:57:51.576342"], ["updated_at", "2017-06-22 22:57:51.576342"]]