W4D4/MusicApp/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save!
---
INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)